In [1]:
import pandas as pd

In [8]:
df = pd.DataFrame({
    'name': ['john', 'mary', 'paul', 'serdar'],
    'age': [30, 25, 38, 25],
    'city': ['new york', 'los angeles', 'london', 'ankara']
})

In [9]:
df

     name  age         city
0    john   30     new york
1    mary   25  los angeles
2    paul   38       london
3  serdar   25       ankara

# Simple Replace

In [11]:
df.replace(25,40)

     name  age         city
0    john   30     new york
1    mary   40  los angeles
2    paul   38       london
3  serdar   40       ankara

## Replace with Dict

In [13]:
df.replace({
    40: 25,
    'john': 'johnny'
})

     name  age         city
0  johnny   30     new york
1    mary   25  los angeles
2    paul   38       london
3  serdar   25       ankara

## Replace with REGEX

In [14]:
df.replace('jo.+', 'hasan', regex=True)

     name  age         city
0   hasan   30     new york
1    mary   25  los angeles
2    paul   38       london
3  serdar   25       ankara

## Replace in a single column with nested Dict

In [15]:
df = pd.DataFrame({
    'name':['john','mary','paul'],
    'num_children':[0,4,5],
    'num_pets':[0,1,2]
})

In [16]:
df

   name  num_children  num_pets
0  john             0         0
1  mary             4         1
2  paul             5         2

In [17]:
df.replace({'num_pets':{0:1}})

   name  num_children  num_pets
0  john             0         1
1  mary             4         1
2  paul             5         2